#### Series

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s = pd.Series(np.arange(1,6))
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
k = np.array([12,34,4,4,4])
k

array([12, 34,  4,  4,  4])

In [4]:
s = pd.Series(np.arange(1,4),index=['USA','Can','Jap'])
s

USA    1
Can    2
Jap    3
dtype: int64

In [5]:
a = np.arange(1,5).reshape(2,2)
a

array([[1, 2],
       [3, 4]])

In [6]:
a = pd.Series({'ank':12,'piu':14,'zar':15})
a

ank    12
piu    14
zar    15
dtype: int64

In [7]:
q1 = pd.Series({'Japan':80,'China':45,'India':34,'USA':42})
q2 = pd.Series({'Japan':120,'China':230,'India':340,'USA':420})
q1,q2

(Japan    80
 China    45
 India    34
 USA      42
 dtype: int64,
 Japan    120
 China    230
 India    340
 USA      420
 dtype: int64)

In [8]:
q1[0] # series accepts both index and keys

80

In [9]:
q1['Japan']

80

In [10]:
s = pd.DataFrame([1,2,3,4,5]) 
s

   0
0  1
1  2
2  3
3  4
4  5

In [11]:
s = pd.DataFrame(np.arange(1,4),index=['USA','Can','Jap'],columns=['Count']) 
s

     Count
USA      1
Can      2
Jap      3

#### Dataframes

In [12]:
# it contains ordered collection of items 
q = pd.DataFrame({'Japan','China','India',420},columns=['Country'])
q

  Country
0     420
1   Japan
2   China
3   India

In [13]:
import datetime as dt

In [14]:
dt.datetime.now()

datetime.datetime(2023, 9, 29, 9, 19, 30, 114419)

In [51]:
a = [1,2,3]
b = [1,4,5]
c = [1,7,8]
d = pd.DataFrame([a,b,c])
d

   0  1  2
0  1  2  3
1  1  4  5
2  1  7  8

In [50]:
d = d.groupby(0).mean()
d

          1         2
0
1  4.333333  5.333333

In [54]:
k = []
for i in range(len(d)):
    k.append(d.iloc[i,:].mean())

k

[2.0, 3.3333333333333335, 5.333333333333333]

In [59]:
e = d.transpose()
e

   0  1  2
0  1  1  1
1  2  4  7
2  3  5  8